<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="x.1" type="Parameter" version="opset1">
			<data shape="1,3,512,1024" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="trunk.early.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="0" size="1728" />
			<output>
				<port id="0" precision="FP32" names="trunk.early.0.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Shape_9" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="275">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1728" size="8" />
			<output>
				<port id="0" precision="I64" names="276" />
			</output>
		</layer>
		<layer id="4" name="Constant_3946" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="Gather_11" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="277" />
			</output>
		</layer>
		<layer id="6" name="Constant_21" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="287" />
			</output>
		</layer>
		<layer id="7" name="Sub_22" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="288" />
			</output>
		</layer>
		<layer id="8" name="Constant_23" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="289" />
			</output>
		</layer>
		<layer id="9" name="Mul_24" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="290" />
			</output>
		</layer>
		<layer id="10" name="Constant_25" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1752" size="8" />
			<output>
				<port id="0" precision="I64" names="291" />
			</output>
		</layer>
		<layer id="11" name="Add_26" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="292" />
			</output>
		</layer>
		<layer id="12" name="Constant_27" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="293" />
			</output>
		</layer>
		<layer id="13" name="Add_28" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="294" />
			</output>
		</layer>
		<layer id="14" name="Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="269">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1728" size="8" />
			<output>
				<port id="0" precision="I64" names="270" />
			</output>
		</layer>
		<layer id="16" name="Constant_3938" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="271" />
			</output>
		</layer>
		<layer id="18" name="Sub_29" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="295" />
			</output>
		</layer>
		<layer id="19" name="Constant_30" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="296" />
			</output>
		</layer>
		<layer id="20" name="Div_31" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="297" />
			</output>
		</layer>
		<layer id="21" name="Cast_32" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="298" />
			</output>
		</layer>
		<layer id="22" name="Cast_33" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="299" />
			</output>
		</layer>
		<layer id="23" name="Constant_3993" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Unsqueeze_53" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="319">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_34" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="300" />
			</output>
		</layer>
		<layer id="26" name="Div_35" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="301" />
			</output>
		</layer>
		<layer id="27" name="Cast_36" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="302" />
			</output>
		</layer>
		<layer id="28" name="Cast_37" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="303" />
			</output>
		</layer>
		<layer id="29" name="Sub_38" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="304" />
			</output>
		</layer>
		<layer id="30" name="Constant_3995" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Unsqueeze_54" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="320">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Shape_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="272">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="273" />
			</output>
		</layer>
		<layer id="34" name="Constant_3942" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="Gather_8" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="274" />
			</output>
		</layer>
		<layer id="36" name="Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="278" />
			</output>
		</layer>
		<layer id="37" name="Sub_13" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="279" />
			</output>
		</layer>
		<layer id="38" name="Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="280" />
			</output>
		</layer>
		<layer id="39" name="Mul_15" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="281" />
			</output>
		</layer>
		<layer id="40" name="Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1768" size="8" />
			<output>
				<port id="0" precision="I64" names="282" />
			</output>
		</layer>
		<layer id="41" name="Add_17" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="283" />
			</output>
		</layer>
		<layer id="42" name="Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="284" />
			</output>
		</layer>
		<layer id="43" name="Add_19" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="285" />
			</output>
		</layer>
		<layer id="44" name="Shape_0" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="266">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="267" />
			</output>
		</layer>
		<layer id="46" name="Constant_3934" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="47" name="Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="268" />
			</output>
		</layer>
		<layer id="48" name="Sub_20" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="286" />
			</output>
		</layer>
		<layer id="49" name="Constant_39" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="305" />
			</output>
		</layer>
		<layer id="50" name="Div_40" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="306" />
			</output>
		</layer>
		<layer id="51" name="Cast_41" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="307" />
			</output>
		</layer>
		<layer id="52" name="Cast_42" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="308" />
			</output>
		</layer>
		<layer id="53" name="Constant_3997" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Unsqueeze_55" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="321">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_43" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="309" />
			</output>
		</layer>
		<layer id="56" name="Div_44" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="310" />
			</output>
		</layer>
		<layer id="57" name="Cast_45" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="311" />
			</output>
		</layer>
		<layer id="58" name="Cast_46" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="312" />
			</output>
		</layer>
		<layer id="59" name="Sub_47" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="313" />
			</output>
		</layer>
		<layer id="60" name="Constant_3999" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Unsqueeze_56" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="322">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Concat_57" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="323">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Cast_65" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="331">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_4012" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="65" name="Constant_61" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1776" size="8" />
			<output>
				<port id="0" precision="I64" names="327" />
			</output>
		</layer>
		<layer id="66" name="Constant_62" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="328" />
			</output>
		</layer>
		<layer id="67" name="Mul_63" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="329" />
			</output>
		</layer>
		<layer id="68" name="Constant_3984" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Unsqueeze_48" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="314">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_3986" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Unsqueeze_49" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="315">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_3988" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Unsqueeze_50" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="316">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_3990" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Unsqueeze_51" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="317">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Concat_52" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="318">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Shape_59" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="325">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_58" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" names="324">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_4004" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="80" name="Gather_60" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="326">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Sub_64" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="330">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ConstantOfShape_66" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="332">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Concat_67" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="333">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_68" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1784" size="16" />
			<output>
				<port id="0" precision="I64" names="334">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_69" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="335">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_71" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1800" size="8" />
			<output>
				<port id="0" precision="I64" names="337">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_72" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1808" size="8" />
			<output>
				<port id="0" precision="I64" names="338">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_73" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1800" size="8" />
			<output>
				<port id="0" precision="I64" names="339">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_70" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" names="336">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Slice_74" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="340">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_4053" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1816" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Transpose_75" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="341">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_76" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1800" size="8" />
			<output>
				<port id="0" precision="I64" names="342">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_77" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="343">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Cast_78" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="344">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_4064" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="97" name="Split_4065" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_79" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1832" size="4" />
			<output>
				<port id="0" precision="FP32" names="345" />
			</output>
		</layer>
		<layer id="99" name="Pad_80" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="346">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>1025</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="1100" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="1836" size="1728" />
			<output>
				<port id="0" precision="FP32" names="1100">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_81/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>1025</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1101" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="3564" size="64" />
			<output>
				<port id="0" precision="FP32" names="1101">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_4649" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="ShapeOf_4664" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="ShapeOf_4647" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="ShapeOf_4648" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_4650" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Subtract_4651" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Broadcast_4652" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Concat_4665" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Reshape_4666" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_81" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1099">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_85" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="3628" size="4" />
			<output>
				<port id="0" precision="FP32" names="352" />
			</output>
		</layer>
		<layer id="114" name="Constant_84" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1832" size="4" />
			<output>
				<port id="0" precision="FP32" names="351" />
			</output>
		</layer>
		<layer id="115" name="Constant_82" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="3632" size="4" />
			<output>
				<port id="0" precision="FP32" names="349" />
			</output>
		</layer>
		<layer id="116" name="Add_83" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="350">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Maximum_4698" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Clip_86" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="353">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_87" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="3628" size="4" />
			<output>
				<port id="0" precision="FP32" names="354" />
			</output>
		</layer>
		<layer id="120" name="Div_88" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Mul_89" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="356">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="trunk.block0.0.conv_dw.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 3, 3" offset="3636" size="576" />
			<output>
				<port id="0" precision="FP32" names="trunk.block0.0.conv_dw.weight">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Shape_99" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="366">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_100" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1728" size="8" />
			<output>
				<port id="0" precision="I64" names="367" />
			</output>
		</layer>
		<layer id="125" name="Constant_4717" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="126" name="Gather_101" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="368" />
			</output>
		</layer>
		<layer id="127" name="Constant_111" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="378" />
			</output>
		</layer>
		<layer id="128" name="Sub_112" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="379" />
			</output>
		</layer>
		<layer id="129" name="Constant_113" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="380" />
			</output>
		</layer>
		<layer id="130" name="Mul_114" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="381" />
			</output>
		</layer>
		<layer id="131" name="Constant_115" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1768" size="8" />
			<output>
				<port id="0" precision="I64" names="382" />
			</output>
		</layer>
		<layer id="132" name="Add_116" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="383" />
			</output>
		</layer>
		<layer id="133" name="Constant_117" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="384" />
			</output>
		</layer>
		<layer id="134" name="Add_118" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="385" />
			</output>
		</layer>
		<layer id="135" name="Shape_93" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="360">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Constant_94" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1728" size="8" />
			<output>
				<port id="0" precision="I64" names="361" />
			</output>
		</layer>
		<layer id="137" name="Constant_4709" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="138" name="Gather_95" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="362" />
			</output>
		</layer>
		<layer id="139" name="Sub_119" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="386" />
			</output>
		</layer>
		<layer id="140" name="Constant_120" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="387" />
			</output>
		</layer>
		<layer id="141" name="Div_121" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="388" />
			</output>
		</layer>
		<layer id="142" name="Cast_122" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="389" />
			</output>
		</layer>
		<layer id="143" name="Cast_123" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="390" />
			</output>
		</layer>
		<layer id="144" name="Constant_4764" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="Unsqueeze_143" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="410">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="Constant_124" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="391" />
			</output>
		</layer>
		<layer id="147" name="Div_125" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="392" />
			</output>
		</layer>
		<layer id="148" name="Cast_126" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="393" />
			</output>
		</layer>
		<layer id="149" name="Cast_127" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="394" />
			</output>
		</layer>
		<layer id="150" name="Sub_128" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="395" />
			</output>
		</layer>
		<layer id="151" name="Constant_4766" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="Unsqueeze_144" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="411">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="Shape_96" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="363">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="Constant_97" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="364" />
			</output>
		</layer>
		<layer id="155" name="Constant_4713" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="156" name="Gather_98" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="365" />
			</output>
		</layer>
		<layer id="157" name="Constant_102" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="369" />
			</output>
		</layer>
		<layer id="158" name="Sub_103" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="370" />
			</output>
		</layer>
		<layer id="159" name="Constant_104" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="371" />
			</output>
		</layer>
		<layer id="160" name="Mul_105" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="372" />
			</output>
		</layer>
		<layer id="161" name="Constant_106" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4212" size="8" />
			<output>
				<port id="0" precision="I64" names="373" />
			</output>
		</layer>
		<layer id="162" name="Add_107" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="374" />
			</output>
		</layer>
		<layer id="163" name="Constant_108" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1744" size="8" />
			<output>
				<port id="0" precision="I64" names="375" />
			</output>
		</layer>
		<layer id="164" name="Add_109" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="376" />
			</output>
		</layer>
		<layer id="165" name="Shape_90" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="357">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="166" name="Constant_91" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="358" />
			</output>
		</layer>
		<layer id="167" name="Constant_4705" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="168" name="Gather_92" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="359" />
			</output>
		</layer>
		<layer id="169" name="Sub_110" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="377" />
			</output>
		</layer>
		<layer id="170" name="Constant_129" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1760" size="8" />
			<output>
				<port id="0" precision="I64" names="396" />
			</output>
		</layer>
		<layer id="171" name="Div_130" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="397" />
			</output>
		</layer>
		<layer id="172" name="Cast_131" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="398" />
			</output>
		</layer>
		<layer id="173" name="Cast_132" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="399" />
			</output>
		</layer>
		<layer id="174" name="Constant_4768" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="175" name="Unsqueeze_145" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="412">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="176" name="Constant_133" type="Const" version="opset1">
