<?xml version="1.0"?>
<net name="Model66" version="11">
	<layers>
		<layer id="0" name="inputs" type="Parameter" version="opset1">
			<data shape="?,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inputs">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1_weights" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="0" size="1728" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d_64.tmp_0" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_64.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv1_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="1728" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="1792" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="1856" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="1920" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv1_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_0.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="hard_swish_0.tmp_0" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="hard_swish_0.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv2_expand_weights" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 1" offset="1984" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2d_65.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_65.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2_expand_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="3008" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv2_expand_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="3072" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2_expand_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="3136" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv2_expand_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="3200" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2_expand_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_1.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="relu_0.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_0.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv2_depthwise_weights" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 3, 3" offset="3264" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_32416" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3840" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_32409" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3840" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Divide_32417" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_32415" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3848" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Concat_32418" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_32419" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="depthwise_conv2d_0.tmp_0" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_0.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2_depthwise_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="3872" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2_depthwise_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="3936" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2_depthwise_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="4000" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv2_depthwise_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="4064" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2_depthwise_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_2.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="relu_1.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_1.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv2_linear_weights" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 1" offset="4128" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv2d_66.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_66.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv2_linear_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="5152" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv2_linear_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="5216" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2_linear_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="5280" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv2_linear_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="5344" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv2_linear_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_3.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="elementwise_add_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv3_expand_weights" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="5408" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv2d_67.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_67.tmp_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv3_expand_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="9504" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv3_expand_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="9760" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv3_expand_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="10016" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv3_expand_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="10272" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv3_expand_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_4.tmp_2">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="relu_2.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_2.tmp_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv3_depthwise_weights" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 3, 3" offset="10528" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_32478" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12832" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_32471" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12832" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Divide_32479" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_32477" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3848" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Concat_32480" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_32481" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="depthwise_conv2d_1.tmp_0" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_1.tmp_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv3_depthwise_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="12840" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv3_depthwise_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="13096" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv3_depthwise_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="13352" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv3_depthwise_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="13608" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv3_depthwise_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_5.tmp_2">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="relu_3.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_3.tmp_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv3_linear_weights" type="Const" version="opset1">
			<data element_type="f32" shape="24, 64, 1, 1" offset="13864" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv2d_68.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_68.tmp_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv3_linear_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="20008" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv3_linear_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="20104" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv3_linear_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="20200" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv3_linear_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="20296" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv3_linear_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_6.tmp_2">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv4_expand_weights" type="Const" version="opset1">
			<data element_type="f32" shape="72, 24, 1, 1" offset="20392" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv2d_69.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_69.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv4_expand_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="27304" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv4_expand_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="27592" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv4_expand_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="27880" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv4_expand_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="28168" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv4_expand_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_7.tmp_2">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="relu_4.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_4.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv4_depthwise_weights" type="Const" version="opset1">
			<data element_type="f32" shape="72, 1, 3, 3" offset="28456" size="2592" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_32539" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31048" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_32532" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31048" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Divide_32540" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_32538" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3848" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Concat_32541" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_32542" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="depthwise_conv2d_2.tmp_0" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_2.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv4_depthwise_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="31056" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv4_depthwise_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="31344" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv4_depthwise_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="31632" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv4_depthwise_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="31920" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv4_depthwise_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_8.tmp_2">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="relu_5.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_5.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv4_linear_weights" type="Const" version="opset1">
			<data element_type="f32" shape="24, 72, 1, 1" offset="32208" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv2d_70.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_70.tmp_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv4_linear_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="39120" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv4_linear_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="39216" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv4_linear_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="39312" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv4_linear_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="39408" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv4_linear_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_9.tmp_2">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="elementwise_add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_1">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv5_expand_weights" type="Const" version="opset1">
			<data element_type="f32" shape="72, 24, 1, 1" offset="39504" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="conv2d_71.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_71.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv5_expand_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="46416" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="conv5_expand_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="46704" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="conv5_expand_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="46992" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv5_expand_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="47280" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="conv5_expand_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_10.tmp_2">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="relu_6.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_6.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv5_depthwise_weights" type="Const" version="opset1">
			<data element_type="f32" shape="72, 1, 5, 5" offset="47568" size="7200" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_32601" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31048" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_32594" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31048" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Divide_32602" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_32600" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="54768" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Concat_32603" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Reshape_32604" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="depthwise_conv2d_3.tmp_0" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_3.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="conv5_depthwise_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="54792" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="conv5_depthwise_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="55080" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="conv5_depthwise_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="55368" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="conv5_depthwise_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="55656" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="conv5_depthwise_bn_mean0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>72</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_11.tmp_2">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="relu_7.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_7.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_32645" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="55944" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="pool2d_0.tmp_0" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="pool2d_0.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="conv5_se_1_weights" type="Const" version="opset1">
			<data element_type="f32" shape="18, 72, 1, 1" offset="55960" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="conv2d_72.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>18</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_72.tmp_0">
					<dim>-1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="conv5_se_1_offset" type="Const" version="opset1">
			<data element_type="f32" shape="18" offset="61144" size="72" />
			<output>
				<port id="0" precision="FP32">
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_32648" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="61216" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Unsqueeze_32649" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="conv2d_72.tmp_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_72.tmp_1">
					<dim>-1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="relu_8.tmp_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_8.tmp_0">
					<dim>-1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="conv5_se_2_weights" type="Const" version="opset1">
			<data element_type="f32" shape="72, 18, 1, 1" offset="61240" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="conv2d_73.tmp_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_73.tmp_0">
					<dim>-1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="conv5_se_2_offset" type="Const" version="opset1">
			<data element_type="f32" shape="72" offset="66424" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Constant_32653" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="61216" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Unsqueeze_32654" type="Unsqueeze" version="opset1">
			<input>
